DataProcessors/РеестреПлательщиковНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РеестреПлательщиковНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЕГРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/РеестреПлательщиковНДС/Forms/Форма/Ext/Form/Module.bsl
Функция ВостановитьДатуJSON(Свойство,Значение,ДополнительныеПараметры) Экспорт
	Если (Свойство = "datReestr")ИЛИ (Свойство = "datAnul") Тогда            
		Если Значение = Неопределено Тогда
			Возврат "";
		КонецЕсли;	
		//Возврат ПрочитатьДатуJSON(Формат(Значение,"ЧГ="),ФорматДатыJSON.Microsoft);
	    сГод = Сред(Значение,1,4);
		сМесяц = Сред(Значение,6,2);
		сДень = Сред(Значение,9,2);
		
		Если ОбщегоНазначенияКлиентСервер.ВходяттолькоЧисловыеСимволы(сГод)= Ложь ИЛИ
			ОбщегоНазначенияКлиентСервер.ВходяттолькоЧисловыеСимволы(сМесяц) = Ложь ИЛИ
			ОбщегоНазначенияКлиентСервер.ВходяттолькоЧисловыеСимволы(сДень) = Ложь  Тогда
			Возврат "Неверный формат даты"; 
		КонецЕсли;
			
		Возврат Формат(Дата(сГод,сМесяц,сДень),"ЧГ=");
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ОчиститьПоля(Команда)
	Объект.ИНН = "";
	Объект.КодЕГРПОУ ="";
	Объект.НаименованиеФИО="";
	
//	Элементы.ДанныеВывод = "";
КонецПроцедуры

&НаСервере
Функция   ПоискПлательщиковНДСHTTP()
	 //берем данные токена и адрес сервера с констант
	 Токен = ОбщееНазначение.ПолучитьЗначениеКонстантыСтрока("ТокенДФС");
	 АдресСервера = ОбщееНазначение.ПолучитьЗначениеКонстантыСтрока("АдресСервераЭлектронногоКабинетаНалоговой");
	 
	 //Данные для поиска упаковуем в структуру
	 СтруктураЗапроса = Новый Структура;
	 СтруктураЗапроса.Вставить("kodPdvList",Объект.ИНН);
	 СтруктураЗапроса.Вставить("tinList",Объект.КодЕГРПОУ);
	 СтруктураЗапроса.Вставить("name",Объект.НаименованиеФИО);
	 СтруктураЗапроса.Вставить("token",Токен);
	 
	 // Параметры запроса на доступ к реестрам и ответ клиенту передаются 
	 // в виде стандартного формата JSON
	 Запись = Новый ЗаписьJSON;	
	 Запись.УстановитьСтроку();
	 ЗаписатьJSON(Запись,СтруктураЗапроса);
	 СтруктураJSON = Запись.Закрыть();
	 
	 //  ЗапросHTTP Содержит заголовки в виде соответствия "Название заголовка" - "Значение"
	 Соответствие = Новый Соответствие;
	 Соответствие.Вставить("Content-Type", "application/json");
	 // С этого момента нечего не понятно, смотрю теорию, пока непонимаю 
	 Соединение = Новый HTTPСоединение(АдресСервера,Неопределено,Неопределено,Неопределено,Неопределено,Неопределено,новый ЗащищенноеСоединениеOpenSSL);
	 
	 ЗапросHTTP = Новый HTTPЗапрос("ws/api/public/registers/pdv_act/list",Соответствие);
	 ЗапросHTTP.УстановитьТелоИзСтроки(СтруктураJSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	 
	 ОтветHTTP = Соединение.ВызватьHTTPМетод("POST",ЗапросHTTP);
	 
	 СтрокаОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
	 
	 ЧтениеJSON = Новый ЧтениеJSON;
	 ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
	 //Данные = ПрочитатьJSON(ЧтениеJSON,Ложь);
	 Реквезиты = Новый Массив;
	 Реквезиты.Добавить("datReestr");
	 Реквезиты.Добавить("datAnul");
	 Данные = ПрочитатьJSON(ЧтениеJSON,Ложь,,,"ВостановитьДатуJSON",ЭтаФорма,,Реквезиты);

	 Текст = "";
	 Для Каждого ЭлМассив из Данные Цикл
		 Для Каждого ЭлСтруктура из ЭлМассив Цикл
			 			 
			   Если ЭлСтруктура.Ключ = "kodPdv" Тогда
				     Текст =Текст + "Номер плательщика НДС - " +Формат(ЭлСтруктура.Значение,"ЧГ=0")+Символы.ПС;
			   КонецЕсли;
			   Если ЭлСтруктура.Ключ = "tin" Тогда
				    Текст =Текст + "ЕГРПОУ - " +Формат(ЭлСтруктура.Значение,"ЧГ=0")+Символы.ПС;
			   КонецЕсли;
			   Если ЭлСтруктура.Ключ = "datReestr" Тогда
				    Текст =Текст + "Дата регистрации плательщиком НДС - " +ЭлСтруктура.Значение+Символы.ПС;
			   КонецЕсли;
               Если ЭлСтруктура.Ключ = "datAnul" Тогда
				    Текст =Текст + "Дата отмены регистрации плательщиком НДС - " +ЭлСтруктура.Значение+Символы.ПС;
			   КонецЕсли;
			   Если ЭлСтруктура.Ключ = "kodPdvs" Тогда
				    Текст =Текст + "Номер плательщика НДС (символьный) - " +ЭлСтруктура.Значение+Символы.ПС;
			   КонецЕсли;
			   Если ЭлСтруктура.Ключ = "danulSg" Тогда
				    Текст =Текст + "Дата аннулирования свидетельства плательщика НДС - " +ЭлСтруктура.Значение+Символы.ПС;
			   КонецЕсли;

			   Если ЭлСтруктура.Ключ = "kodAnul" Тогда
				    Текст =Текст + "Причина отмены регистрации плательщиком НДС - " +ЭлСтруктура.Значение+Символы.ПС;
			   КонецЕсли;

			   Если ЭлСтруктура.Ключ = "kodPid" Тогда
				    Текст =Текст + "Основание отмены регистрации плательщиком НДС - " +ЭлСтруктура.Значение+Символы.ПС;
			   КонецЕсли;

		 КонецЦикла;	 
	 КонецЦикла;	 
	 Возврат Текст;                                 
КонецФункции
&НаКлиенте
Процедура Поиск(Команда)
	ДанныеВывод = ПоискПлательщиковНДСHTTP();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ИНН = "054097414040";
КонецПроцедуры
